lab2&3/app/controllers/comments_controller.rb

    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('Mohamed', 'Comment\r\n', 1, '2019-04-21 18:26:12', '2019-04-21 18:26:12')