app/controllers/articles_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
    def edit
        @article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('Mohamed', 'test', '2019-04-21 17:32:17', '2019-04-21 17:32:17')
---
    def create
        @article = Article.new(article_params)

        if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 3
---
    def destroy
        @article = Article.find(params[:id])
        @article.destroy