app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `encrypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('Mohamed', 'test@test.com', '$2a$10$14B5Z7x6C82k4Z4pe1dlZukL7Bh5nXuwaqKja4EQrXwBAcjc5HgHG', '$2a$10$14B5Z7x6C82k4Z4pe1dlZu', '2019-04-21 19:16:46', '2019-04-21 19:16:46')
---
  def create
    @user = User.new(user_params)
    if @user.save